# LAB - 8

In [1]:
import pandas as pd 
import numpy as np

1. Create a .csv file with data given below and read it as dataframe

(a) Find number of null values in blue column and replace it with median of the blue column.

(b) Group the blue column based on animals and calculate mean of each group.

(c)Group the above data frame based on animal, apply sum() function and display.

(d). Group the above data frame based on animal &amp; green, apply sum() function and display.

In [13]:
data = pd.read_csv('data8.csv')
data

   white  red  blue  green animal
0      1  5.0   2.0      3    cat
1      2  7.0   8.0      5    dog
2      3  NaN   6.0      7  horse
3      4  5.0   6.0      7   duck
4      9  NaN   NaN      6  mouse
5      9  8.0   7.0      6  mouse
6      9  8.0   7.0      6  mouse

In [3]:
data.isnull().sum()

white     0
red       2
blue      1
green     0
animal    0
dtype: int64

In [11]:
data.groupby(['animal'])[['blue']].mean()

        blue
animal
cat      2.0
dog      8.0
duck     6.0
horse    6.0
mouse    7.0

In [12]:
data.groupby(['animal']).sum()

        white   red  blue  green
animal
cat         1   5.0   2.0      3
dog         2   7.0   8.0      5
duck        4   5.0   6.0      7
horse       3   0.0   6.0      7
mouse      27  16.0  14.0     18

In [14]:
data.groupby(['animal','green']).sum()

              white   red  blue
animal green
cat    3          1   5.0   2.0
dog    5          2   7.0   8.0
duck   7          4   5.0   6.0
horse  7          3   0.0   6.0
mouse  6         27  16.0  14.0

2. Create a list with 20 different numerical values and divide it as 4 groups namely poor, satisfactory,
good and excellent. Display values with their group names.

In [22]:
num = np.random.randint(1,100,size=20)
pd_ser = pd.Series(num)
bin_label= 'poor,satisfactory,good,excellent'.split(',')
bins = [0,25,50,75,100]
grouped = pd.cut(pd_ser,bins=bins,labels=bin_label)
grouped

0        excellent
1             good
2        excellent
3             good
4             good
5             good
6        excellent
7     satisfactory
8     satisfactory
9     satisfactory
10    satisfactory
11            good
12            poor
13            poor
14            good
15            poor
16            good
17    satisfactory
18    satisfactory
19            poor
dtype: category
Categories (4, object): ['poor' < 'satisfactory' < 'good' < 'excellent']

3. For the given DataFrame df, write a python statement to sort the DataFrame in the descending order
of points:

In [29]:
data2 = pd.read_csv('data8a.csv',sep = ' ')
data2.points.sort_values(ascending=False)

1    600
4    550
0    500
3    400
2    300
Name: points, dtype: int64

4. Write a program to calculate covariance for the given datasets for the number of items purchased
with their unit price as under

In [30]:
Unit_price=[10,20,50,80,100]
No_items=[30,45,40,20,40]
np.cov(Unit_price,No_items)

array([[1470.,  -75.],
       [ -75.,  100.]])

5. For the given DataFrame df1, df2, write python program

a) Apply the merge() the two dataframe.

b) apply the concat() the two dataframe by column and row –wise.

c) apply the join() the two dataframe.

d) apply the combine the dataframe df1 in the first.

e) apply the combine the dataframe df2 in the first.

In [32]:
df1 = pd.read_csv('data8b.csv',sep = ' ')
df1

        id  color brand
0     ball  white   OMG
1   pencil    red   ABC
2      pen    red   ABC
3      mug  black   POD
4  ashtray  green   POD

In [34]:
df2 = pd.read_csv('data8c.csv',sep= ' ')
df2

       id brand
0  pencil   OMG
1  pencil   POD
2    ball   ABC
3     pen   POD

In [35]:
df1.merge(df2)

Empty DataFrame
Columns: [id, color, brand]
Index: []

In [45]:
pd.concat([df1,df2])

        id  color brand
0     ball  white   OMG
1   pencil    red   ABC
2      pen    red   ABC
3      mug  black   POD
4  ashtray  green   POD
0   pencil    NaN   OMG
1   pencil    NaN   POD
2     ball    NaN   ABC
3      pen    NaN   POD

In [51]:
df1.join(df2.set_index('brand'),on='brand',rsuffix='_other')

        id  color brand id_other
0     ball  white   OMG   pencil
1   pencil    red   ABC     ball
2      pen    red   ABC     ball
3      mug  black   POD   pencil
3      mug  black   POD      pen
4  ashtray  green   POD   pencil
4  ashtray  green   POD      pen

In [53]:
df1.combine(df2,func=lambda x,y:x )

  brand  color       id
0   OMG  white     ball
1   ABC    red   pencil
2   ABC    red      pen
3   POD  black      mug
4   POD  green  ashtray

In [54]:
df1.combine(df2,func=lambda x,y:y )

  brand color      id
0   OMG   NaN  pencil
1   POD   NaN  pencil
2   ABC   NaN    ball
3   POD   NaN     pen
4   NaN   NaN     NaN

6.Write a program to split for the given dataset into groups and display target columns as a list of unique
values.(split,apply,combine)

In [55]:
df4 = pd.read_csv('data8d.csv',sep=" ")
df4

   color status  Value1  Value2
0  White     Up   12.33   11.23
1  Black     Up   14.35   31.80
2  white   Down   22.34   29.99
3  white   Down   27.84   31.18
4  black   Down   23.40   18.25
5  black     up   18.33   22.44

In [56]:
df5 = df4[df4.status=='Up']
df5

   color status  Value1  Value2
0  White     Up   12.33   11.23
1  Black     Up   14.35   31.80

In [58]:
df6 = df4[df4.status=='Down']
df6

   color status  Value1  Value2
2  white   Down   22.34   29.99
3  white   Down   27.84   31.18
4  black   Down   23.40   18.25

In [59]:
df5['value1**2']= df5.Value1.apply(lambda x:x**2)
df6['value1**2']= df6.Value1.apply(lambda x:x**2)

C:\Users\HRITHI~1\AppData\Local\Temp/ipykernel_1824/4211313922.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df5['value1**2']= df5.Value1.apply(lambda x:x**2)
C:\Users\HRITHI~1\AppData\Local\Temp/ipykernel_1824/4211313922.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df6['value1**2']= df6.Value1.apply(lambda x:x**2)

In [61]:
pd.concat([df5,df6])

   color status  Value1  Value2  value1**2
0  White     Up   12.33   11.23   152.0289
1  Black     Up   14.35   31.80   205.9225
2  white   Down   22.34   29.99   499.0756
3  white   Down   27.84   31.18   775.0656
4  black   Down   23.40   18.25   547.5600

7.For the given DataFrame df, write a python program

a) The price1 column and call the group by() function with the color column.

b) to apply the operation on the group to obtain the results for each individual group.

c) make a grouping of multiple keys hierarchical

In [68]:
data7 = pd.read_csv('data8f.csv',sep=' ')
data7

   color   object  price1  price2
0  white      Pen    5.56    4.75
1    red   Pencil    4.20    4.12
2  green   Pencil    1.30    1.60
3    red  ashtray    0.56    0.75
4  green      pen    2.75    3.15

In [82]:
w= data7.groupby(['color','price1']).sum()
print(w)

              price2
color price1
green 1.30      1.60
      2.75      3.15
red   0.56      0.75
      4.20      4.12
white 5.56      4.75

In [87]:
data7.groupby(['color']).mean()

       price1  price2
color
green   2.025   2.375
red     2.380   2.435
white   5.560   4.750

In [86]:
data7.unstack()

color   0      white
        1        red
        2      green
        3        red
        4      green
object  0        Pen
        1     Pencil
        2     Pencil
        3    ashtray
        4        pen
price1  0       5.56
        1        4.2
        2        1.3
        3       0.56
        4       2.75
price2  0       4.75
        1       4.12
        2        1.6
        3       0.75
        4       3.15
dtype: object

8. Write python code for given data set Convert to wide frame

In [62]:
#8 
data8 = pd.read_csv('data8e.csv',sep=' ')
data8

   color  item     value
0  white  ball  0.091438
1  white   pen  0.495049
2  white   mug  0.956225
3    red  ball  0.394441
4    red   pen  0.501164
5    red   mug  0.561832
6  black  ball  0.879022
7  black   pen  0.610975
8  black   mug  0.093324

In [66]:
data8.pivot_table(index=['item'],columns='color',values='value')

color     black       red     white
item
ball   0.879022  0.394441  0.091438
mug    0.093324  0.561832  0.956225
pen    0.610975  0.501164  0.495049

---